import React from "react";
import { Modal } from "../../../shared/ui/modal";

export const HowToModal = ({ isOpen, onClose }) => {
  return (
    <Modal
      className={`howto-modal ${isOpen ? "_active" : ""}`}
      isOpen={isOpen}
      onClose={onClose}
    >
      <div className="howto-modal__wrapper">
        <div className="modal-cross" onClick={onClose}>
          <svg
            width="14"
            height="15"
            viewBox="0 0 14 15"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M1.70711 0.792893C1.31658 0.402369 0.683418 0.402369 0.292893 0.792893C-0.097631 1.18342 -0.0976312 1.81658 0.292893 2.20711L5.5858 7.50002L0.292922 12.7929C-0.0976021 13.1834 -0.0976021 13.8166 0.292922 14.2071C0.683447 14.5976 1.31661 14.5976 1.70714 14.2071L7.00001 8.91423L12.2929 14.2071C12.6834 14.5976 13.3166 14.5976 13.7071 14.2071C14.0976 13.8166 14.0976 13.1834 13.7071 12.7929L8.41423 7.50002L13.7071 2.20711C14.0977 1.81658 14.0977 1.18342 13.7071 0.792895C13.3166 0.40237 12.6834 0.402371 12.2929 0.792895L7.00001 6.0858L1.70711 0.792893Z"
              fill="#6F767E"
            />
          </svg>
        </div>
        <div className="howto-modal__title">Как поднять позиции сайта выше</div>
        <div className="howto-modal__body">
          <div className="howto-modal__desc">
            В вашем тарифе установлена средняя абонентская плата и заложено
            оптимальное количество работ в месяц для вашей тематики. Если вы
            хотите, чтобы позиции сайта росли быстрее, мы можем увеличить вашу
            абонентскую плату и соответственно объем выполняемых работ.
          </div>
          <div className="howto-modal__items">
            <div className="howto-modal__step">
              <div className="howto-modal__step-top">
                <svg
                  width="48"
                  height="48"
                  viewBox="0 0 48 48"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M38 22H18C16.8954 22 16 22.8954 16 24V32C16 33.1046 16.8954 34 18 34H38C39.1046 34 40 33.1046 40 32V24C40 22.8954 39.1046 22 38 22ZM18 18C14.6863 18 12 20.6863 12 24V32C12 35.3137 14.6863 38 18 38H38C41.3137 38 44 35.3137 44 32V24C44 20.6863 41.3137 18 38 18H18Z"
                    fill="#FFBC99"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M10 14H30C31.1046 14 32 14.8954 32 16V18H36V16C36 12.6863 33.3137 10 30 10H10C6.68629 10 4 12.6863 4 16V24C4 27.3137 6.68629 30 10 30H12V26H10C8.89543 26 8 25.1046 8 24V16C8 14.8954 8.89543 14 10 14Z"
                    fill="#FFBC99"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M28 32C30.2091 32 32 30.2091 32 28C32 25.7909 30.2091 24 28 24C25.7909 24 24 25.7909 24 28C24 30.2091 25.7909 32 28 32Z"
                    fill="#FFBC99"
                  />
                  <path
                    d="M22 28C22 29.1046 21.1046 30 20 30C18.8954 30 18 29.1046 18 28C18 26.8954 18.8954 26 20 26C21.1046 26 22 26.8954 22 28Z"
                    fill="#FFBC99"
                  />
                  <path
                    d="M38 28C38 29.1046 37.1046 30 36 30C34.8954 30 34 29.1046 34 28C34 26.8954 34.8954 26 36 26C37.1046 26 38 26.8954 38 28Z"
                    fill="#FFBC99"
                  />
                </svg>
              </div>
              <div className="howto-modal__step-bottom">
                <p>Абонентская плата</p>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M13.293 6.20711C12.9025 5.81658 12.9025 5.18342 13.293 4.79289C13.6836 4.40237 14.3167 4.40237 14.7073 4.79289L20.5002 10.5858C21.2812 11.3668 21.2812 12.6332 20.5002 13.4142L14.7073 19.2071C14.3167 19.5976 13.6836 19.5976 13.293 19.2071C12.9025 18.8166 12.9025 18.1834 13.293 17.7929L18.0859 13L4.00015 13C3.44787 13 3.00015 12.5523 3.00015 12C3.00015 11.4477 3.44787 11 4.00015 11L18.0859 11L13.293 6.20711Z"
                    fill="#1A1D1F"
                  />
                </svg>
              </div>
            </div>
            <div className="howto-modal__step">
              <div className="howto-modal__step-top">
                <svg
                  width="48"
                  height="48"
                  viewBox="0 0 48 48"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M24 40C32.8366 40 40 32.8366 40 24C40 15.1634 32.8366 8 24 8C15.1634 8 8 15.1634 8 24C8 32.8366 15.1634 40 24 40ZM24 44C35.0457 44 44 35.0457 44 24C44 12.9543 35.0457 4 24 4C12.9543 4 4 12.9543 4 24C4 35.0457 12.9543 44 24 44Z"
                    fill="#FFBC99"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M24 12C25.1046 12 26 12.8954 26 14V23.1716L30.4142 27.5858C31.1953 28.3668 31.1953 29.6332 30.4142 30.4142C29.6332 31.1953 28.3668 31.1953 27.5858 30.4142L23.1716 26C22.4214 25.2499 22 24.2324 22 23.1716V14C22 12.8954 22.8954 12 24 12Z"
                    fill="#FFBC99"
                  />
                </svg>
              </div>
              <div className="howto-modal__step-bottom">
                <p>Время специалистов</p>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M13.293 6.20711C12.9025 5.81658 12.9025 5.18342 13.293 4.79289C13.6836 4.40237 14.3167 4.40237 14.7073 4.79289L20.5002 10.5858C21.2812 11.3668 21.2812 12.6332 20.5002 13.4142L14.7073 19.2071C14.3167 19.5976 13.6836 19.5976 13.293 19.2071C12.9025 18.8166 12.9025 18.1834 13.293 17.7929L18.0859 13L4.00015 13C3.44787 13 3.00015 12.5523 3.00015 12C3.00015 11.4477 3.44787 11 4.00015 11L18.0859 11L13.293 6.20711Z"
                    fill="#1A1D1F"
                  />
                </svg>
              </div>
            </div>
            <div className="howto-modal__step">
              <div className="howto-modal__step-top">
                <svg
                  width="48"
                  height="48"
                  viewBox="0 0 48 48"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M9.58579 24.9142C10.3668 25.6953 11.6332 25.6953 12.4142 24.9142L24 13.3284L35.5858 24.9142C36.3668 25.6953 37.6332 25.6953 38.4142 24.9142C39.1953 24.1332 39.1953 22.8668 38.4142 22.0858L26.8284 10.5C25.2663 8.9379 22.7337 8.93791 21.1716 10.5L9.58579 22.0858C8.80474 22.8668 8.80474 24.1332 9.58579 24.9142Z"
                    fill="#FFBC99"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M9.58579 37.4142C10.3668 38.1953 11.6332 38.1953 12.4142 37.4142L24 25.8284L35.5858 37.4142C36.3668 38.1953 37.6332 38.1953 38.4142 37.4142C39.1953 36.6332 39.1953 35.3668 38.4142 34.5858L26.8284 23C25.2663 21.4379 22.7337 21.4379 21.1716 23L9.58579 34.5858C8.80474 35.3668 8.80474 36.6332 9.58579 37.4142Z"
                    fill="#FFBC99"
                  />
                </svg>
              </div>
              <div className="howto-modal__step-bottom">
                <p>Место в выдаче</p>
              </div>
            </div>
          </div>
          <a href="/" className="howto-modal__btn">
            Получить коммерческое предложение
          </a>
        </div>
      </div>
    </Modal>
  );
};
